Repository: MengT168/Flutter_Laravel_Pro
Catalog: lib/l10n/app_*.arb
Languages: km

source: My Shop
km: ហាងរបស់ខ្ញុំ

source: Home
km: ទំព័រដើម

source: Orders
km: ការបញ្ជាទិញ

source: Cart
km: កន្ត្រកទំនិញ

source: Profile
km: គណនី

source: New Arrivals
km: ទំនិញថ្មីៗ

source: Promotions
km: ប្រូម៉ូសិន

source: Popular Products
km: ផលិតផលពេញនិយម

source: See All
km: មើលទាំងអស់

source: Product Detail
km: ព័ត៌មានលម្អិតផលិតផល

source: Loading...
km: កំពុងផ្ទុក...

source: Product not found.
km: រកមិនឃើញផលិតផលទេ។

source: Size
km: ទំហំ

source: Color
km: ពណ៌

source: Quantity
km: បរិមាណ

source: Description
km: ការពិពណ៌នា

source: Related Products
km: ផលិតផលពាក់ព័ន្ធ

# loginToAdd
source: Please login to add items to your cart.
km: សូមចូលដើម្បីបន្ថែមទំនិញទៅកន្ត្រករបស់អ្នក។

source: Added to cart!
km: បានបន្ថែមទៅកន្ត្រក!

# failedToAdd
source: Failed to add item to cart.
km: ការបន្ថែមទំនិញទៅកន្ត្រកបានបរាជ័យ។

source: My Cart
km: កន្ត្រករបស់ខ្ញុំ

# loginToViewCart
source: Login to see your cart items.
km: ចូលដើម្បីមើលទំនិញក្នុងកន្ត្រករបស់អ្នក។

# cartIsEmpty
source: Your Cart is Empty
km: កន្ត្រកទំនិញរបស់អ្នកនៅទទេ។

# cartIsEmptyMessage
source: Looks like you haven't added anything to your cart yet.
km: ហាក់ដូចជាអ្នកមិនទាន់បានបន្ថែម ទំនិញចូលក្នុងកន្ត្រករបស់អ្នកនៅឡើយទេ

source: Proceed to Checkout
km: បន្តការទូទាត់

source: Remove Item?
km: លុបទំនិញ?

# removeItemConfirm
source: Are you sure you want to remove this item from your cart?
km: តើអ្នកប្រាកដជាចង់លុបទំនិញនេះចេញពីកន្ត្រកមែនទេ?

source: Cancel
km: បោះបង់

source: Remove
km: លុប

# itemRemovedSuccess
source: Item removed successfully
km: បានលុបទំនិញដោយជោគជ័យ

# itemRemovedFail
source: Failed to remove item
km: ការលុបទំនិញបរាជ័យ

source: Subtotal
km: សរុប

source: Shipping
km: ថ្លៃដឹកជញ្ជូន

source: Total
km: សរុប

source: My Orders
km: ការបញ្ជាទិញរបស់ខ្ញុំ

# loginToViewOrders
source: Login to see your order history.
km: ចូលដើម្បីមើលប្រវត្តិបញ្ជាទិញរបស់អ្នក។

# youHaveNoOrders
source: You have no orders yet.
km: អ្នកមិនទាន់មានការបញ្ជាទិញទេ។

source: Cancel Order
km: បោះបង់ការបញ្ជាទិញ

# cancelOrderConfirm
source: Are you sure you want to cancel this order?
km: តើអ្នកប្រាកដទេថាចង់បោះបង់ការបញ្ជាទិញនេះ?

source: No
km: ទេ

source: Yes, Cancel
km: បាទ/ចាស បោះបង់

# orderCancellationSuccess
source: Order cancellation successful
km: ការបោះបង់ការបញ្ជាទិញបានជោគជ័យ

# orderCancellationFail
source: Order cancellation failed
km: ការបោះបង់ការបញ្ជាទិញបានបរាជ័យ

# orderNumber
source: Order #{transactionId}
km: ការបញ្ជាទិញ #${transactionId}

# recipient
source: Recipient: {name}
km: អ្នកទទួល: {name}

# date
source: Date: {date}
km: កាលបរិច្ឆេទ: {date}

# orderPlacedSuccess
source: Order Placed Successfully!
km: ការបញ្ជាទិញបានជោគជ័យ!

# thankYouPurchase
source: Thank you for your purchase.
km: សូមអរគុណសម្រាប់ការទិញរបស់អ្នក។

source: Continue Shopping
km: បន្តការទិញទំនិញ

source: You are not logged in.
km: អ្នកមិនបានចូលទេ។

# loginOrRegister
source: Login / Register
km: ចូល / ចុះឈ្មោះ

source: Username
km: ឈ្មោះអ្នកប្រើប្រាស់

source: Email
km: អ៊ីមែល

# phone
source: Phone: {phone}
km: ទូរស័ព្ទ

source: Date of birth
km: ថ្ងៃខែឆ្នាំកំណើត

# address
source: Address: {address}
km: អាសយដ្ឋាន

source: Appearance
km: រូបរាង

source: Language
km: ភាសា

source: Light
km: ពន្លឺ

source: System
km: ប្រព័ន្ធ

source: Dark
km: ងងឹត

source: English
km: ភាសាអង់គ្លេស

source: Dashboard
km: ផ្ទាំងគ្រប់គ្រង

source: Logout
km: ចាកចេញ

source: Administrator Access
km: ការចូលប្រើរបស់អ្នកគ្រប់គ្រង

source: Delivery Prices
km: តម្លៃដឹកជញ្ជូន

# sendNotification
source: Send notification to all users
km: ផ្ញើការជូនដំណឹងទៅអ្នកប្រើប្រាស់ទាំងអស់

source: Users
km: អ្នកប្រើប្រាស់

source: Categories
km: ប្រភេទ

source: Attributes
km: គុណលក្ខណៈ

source: Logos
km: ឡូហ្គោ

source: Products
km: ផលិតផល

source: Earnings
km: ចំណូល

source: Pending Orders
km: ការបញ្ជាទិញកំពុងរង់ចាំ

source: Orders In Progress
km: ការបញ្ជាទិញកំពុងដំណើរការ

source: Settings
km: ការកំណត់

source: Done
km: រួចរាល់

# remove_item_title
source: Remove Item
km: លុបផលិតផល

# remove_item_message
source: Are you sure you want to remove this item from your cart?
km: តើអ្នកចង់លុបផលិតផលនេះចេញពីរទូរទំនិញរបស់អ្នកមែនទេ?

# item_removed_success
source: Item removed successfully
km: បានលុបផលិតផលដោយជោគជ័យ

# item_removed_failed
source: Failed to remove item
km: លុបផលិតផលមិនបានជោគជ័យទេ

# update_quantity_failed
source: Failed to update quantity
km: ការកែប្រែចំនួនបរាជ័យ

source: No name
km: គ្មានឈ្មោះ

source: Proceed to Checkout
km: បន្តទិញទំនិញ

# empty_cart_title
source: Your cart is empty
km: រទូរទំនិញទទេ

# empty_cart_message
source: Looks like you havenâ€™t added anything yet.
km: មិនមានផលិតផលក្នុងរទូរទំនិញទេ។

# login_prompt
source: Please log in to continue
km: សូមចូលប្រើដើម្បីបន្ត
